dcc2011/drupal-themeing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Drupal Themeing</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-11 Sat"/>
<meta name="author" content="Bart Lantz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="dcc2011.html  "> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Drupal Themeing</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Part 1 why themes? how themes work </a>
<ul>
<li><a href="#sec-1_1">1.1 why themes? </a>
<ul>
<li><a href="#sec-1_1_1">1.1.1 separation is useful </a></li>
<li><a href="#sec-1_1_2">1.1.2 style + markup + data </a></li>
</ul>
</li>
<li><a href="#sec-1_2">1.2 how do themes work </a>
<ul>
<li><a href="#sec-1_2_1">1.2.1 info file </a></li>
<li><a href="#sec-1_2_2">1.2.2 section templates </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Part II themeing in practise </a>
<ul>
<li><a href="#sec-2_1">2.1 mytheme.info </a>
<ul>
<li><a href="#sec-2_1_1">2.1.1 Themeing Revelations </a></li>
</ul>
</li>
<li><a href="#sec-2_2">2.2 css </a></li>
<li><a href="#sec-2_3">2.3 functional overrides </a>
<ul>
<li><a href="#sec-2_3_1">2.3.1 $ variable are coming from theme_username </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Part 1 why themes? how themes work </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> why themes? </h3>
<div class="outline-text-3" id="text-1_1">


</div>

<div id="outline-container-1_1_1" class="outline-4">
<h4 id="sec-1_1_1"><span class="section-number-4">1.1.1</span> separation is useful </h4>
<div class="outline-text-4" id="text-1_1_1">

<ul>
<li id="sec-1_1_1_1">flexible <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_1_2">maintainable <br/>
</li>
</ul>
<ul>
<li id="sec-1_1_1_3">accessible <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1_1_2" class="outline-4">
<h4 id="sec-1_1_2"><span class="section-number-4">1.1.2</span> style + markup + data </h4>
<div class="outline-text-4" id="text-1_1_2">

</div>
</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> how do themes work </h3>
<div class="outline-text-3" id="text-1_2">

<ul>
<li>styles  .css
</li>
<li>markup .tpl.php
</li>
<li>scripting .js
</li>
<li>block regions, settings .info
</li>
<li>overrides template.php
</li>
</ul>


</div>

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> info file </h4>
<div class="outline-text-4" id="text-1_2_1">


<p>
base theme: garland
</p></div>

</div>

<div id="outline-container-1_2_2" class="outline-4">
<h4 id="sec-1_2_2"><span class="section-number-4">1.2.2</span> section templates </h4>
<div class="outline-text-4" id="text-1_2_2">

<ul>
<li id="sec-1_2_2_1">page.tpl.php <br/>
<ul>
<li>entire page
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1_2_2_2">block.tpl.php <br/>
<ul>
<li>blocks sections
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1_2_2_3">node.tpl.php <br/>
<ul>
<li>the main node
</li>
<li>in teaser view, the nodes
</li>
</ul>

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Part II themeing in practise </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> mytheme.info </h3>
<div class="outline-text-3" id="text-2_1">


</div>

<div id="outline-container-2_1_1" class="outline-4">
<h4 id="sec-2_1_1"><span class="section-number-4">2.1.1</span> Themeing Revelations </h4>
<div class="outline-text-4" id="text-2_1_1">

<ol>
<li>modules provide initial templates and markup, themes only override
  default behavior.
</li>
<li>clear cache to refresh theme information
</li>
<li>in additiona to  
</li>
<li>all drupl markup comes from tpl.php or theme.inc functions
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> css </h3>
<div class="outline-text-3" id="text-2_2">

<ol>
<li>add to your themes .info file
</li>
</ol>


</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> functional overrides </h3>
<div class="outline-text-3" id="text-2_3">


</div>

<div id="outline-container-2_3_1" class="outline-4">
<h4 id="sec-2_3_1"><span class="section-number-4">2.3.1</span> $ variable are coming from theme_username </h4>
<div class="outline-text-4" id="text-2_3_1">

<ul>
<li id="sec-2_3_1_1">theme.inc <br/>
<ul>
<li>theme_username in theme.inc
</li>
<li>can copy functions from theme.inc into template.php
</li>
<li>prepend your theme name to customized theme functions
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-2_3_1_2">devel modeul <br/>
<ul>
<li>dpm() prints out attributes onto page, so you can inspect passed in arrays
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-2_3_1_3">drupal 7 change <br/>
<ol>
<li>drupal 6
</li>
</ol>

<p>mytheme_foo($a, $b); 
</p>
<ol>
<li>drupal 7
</li>
</ol>

<p>mytheme_foo(array($a, $b) ); 
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-06-11 Sat</p>
<p class="author">Author: Bart Lantz</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
